src/Documents/ЕженедельныйОтчет/ЕженедельныйОтчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЕженедельныйОтчет</name>
  <posting>Deny</posting>
  <registerRecords>AccumulationRegister.РабочееВремяПользователей</registerRecords>
  <attributes>
    <name>ДлительностьРабот</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьРабочая</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Достижения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Неудачи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Планы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>Работа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сб</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вс</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пн</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вт</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ср</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Чт</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пт</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидРабот</name>
      <type>
        <types>CatalogRef.ВидыРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроектнаяЗадача</name>
      <type>
        <types>CatalogRef.ПроектныеЗадачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Источник</name>
      <type>
        <types>CatalogRef.Проекты</types>
        <types>DocumentRef.ВходящееПисьмо</types>
        <types>TaskRef.ЗадачаИсполнителя</types>
        <types>DocumentRef.ИсходящееПисьмо</types>
        <types>CatalogRef.ЗаписиРабочегоКалендаря</types>
        <types>CatalogRef.Файлы</types>
        <types>CatalogRef.ВходящиеДокументы</types>
        <types>CatalogRef.ВнутренниеДокументы</types>
        <types>DocumentRef.ЕжедневныйОтчет</types>
        <types>CatalogRef.ИсходящиеДокументы</types>
        <types>CatalogRef.Мероприятия</types>
        <types>CatalogRef.ПроектныеЗадачи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДниНедели</name>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>EnumRef.ДниНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДня</name>
      <type>
        <types>EnumRef.ВидыДней</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоДня</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеДня</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕжедневныйОтчет</name>
      <type>
        <types>DocumentRef.ЕжедневныйОтчет</types>
      </type>
    </attributes>
    <attributes>
      <name>ДлительностьРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлительностьРабочая</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/РабочееВремяПользователей/РабочееВремяПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РабочееВремяПользователей</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ДлительностьВВыходные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлительностьВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлительностьРабочая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлительностьСверхурочно</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Работа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРабот</name>
    <type>
      <types>CatalogRef.ВидыРабот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроектнаяЗадача</name>
    <type>
      <types>CatalogRef.ПроектныеЗадачи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>DocumentRef.ЕжедневныйОтчет</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.Мероприятия</types>
      <types>CatalogRef.ПроектныеЗадачи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/InformationRegisters/ФактическиеТрудозатраты/ФактическиеТрудозатраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФактическиеТрудозатраты</name>
  <resources>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлительностьСверхурочно</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлительностьВВыходные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЕжедневныйОтчет</name>
    <type>
      <types>DocumentRef.ЕженедельныйОтчет</types>
      <types>DocumentRef.ЕжедневныйОтчет</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеРаботы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>CatalogRef.Контроль</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.ЕженедельныйОтчет</types>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>DocumentRef.Отсутствие</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>DocumentRef.ЕжедневныйОтчет</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.Мероприятия</types>
      <types>CatalogRef.ПроектныеЗадачи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроектнаяЗадача</name>
    <type>
      <types>CatalogRef.ПроектныеЗадачи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРабот</name>
    <type>
      <types>CatalogRef.ВидыРабот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьОписаниеРаботы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерДобавления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Начало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Окончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ПолитикиУчетаРабочегоВремени/ПолитикиУчетаРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПолитикиУчетаРабочегоВремени</name>
  <enumValues>
    <name>НеУчитывать</name>
  </enumValues>
  <enumValues>
    <name>ИспользоватьЕжедневныеОтчеты</name>
  </enumValues>
  <enumValues>
    <name>ИспользоватьЕженедельныеОтчеты</name>
  </enumValues>
  <enumValues>
    <name>ИспользоватьЕжедневныеИЕженедельныеОтчеты</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ЕженедельныйОтчет/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДлительностьВсегоМин = 0;
	ДлительностьРабочегоВремениМин = 0;
	Если Работы.Количество() <> 0 Тогда
		Длительность = Новый Соответствие;
		ДлительностьРабочегоВремени = Новый Соответствие;
		СоответствиеДнейНедели = СоответствиеДнейНедели();
		ВидыРабот = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Работы.ВыгрузитьКолонку("ВидРабот"));
		ВидыВремени = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ВидыРабот, "ВидВремени");
		Для Каждого Строка Из Работы Цикл
			Для Каждого КлючИЗначение Из СоответствиеДнейНедели() Цикл
				ДлительностьВДне = Час(Строка[КлючИЗначение.Значение]) * 60 + Минута(Строка[КлючИЗначение.Значение]);
				ДлительностьВсегоМин = ДлительностьВсегоМин + ДлительностьВДне;
				ВидВремени = ВидыВремени[Строка.ВидРабот].ВидВремени;
				Если ВидВремени = ПредопределенноеЗначение("Перечисление.ВидыВремени.Рабочее") Тогда
					ДлительностьРабочегоВремениМин = ДлительностьРабочегоВремениМин + ДлительностьВДне;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	Иначе
		Для Каждого Строка Из ДниНедели Цикл
			РазделеннаяДлительность = СтрРазделить(Строка.ДлительностьРабот, ":");
			Если РазделеннаяДлительность.Количество() = 2 Тогда
				ДлительностьВсегоМин = ДлительностьВсегоМин 
					+ Число(РазделеннаяДлительность[0]) * 60
					+ Число(РазделеннаяДлительность[1]);
			КонецЕсли;
			РазделеннаяДлительность = СтрРазделить(Строка.ДлительностьРабочая, ":");
			Если РазделеннаяДлительность.Количество() = 2 Тогда
				ДлительностьРабочегоВремениМин = ДлительностьРабочегоВремениМин 
					+ Число(РазделеннаяДлительность[0]) * 60
					+ Число(РазделеннаяДлительность[1]);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	ДлительностьРабот = УчетВремениКлиентСервер.ПолучитьВВидеДатыИзМин(ДлительностьВсегоМин);
	ДлительностьРабочая = УчетВремениКлиентСервер.ПолучитьВВидеДатыИзМин(ДлительностьРабочегоВремениМин);

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Движения.РабочееВремяПользователей.Записывать = Истина;
	Движения.РабочееВремяПользователей.Очистить();
	
	Если ПометкаУдаления Тогда 
		Возврат;
	КонецЕсли;
	
	// Очистим "регистратор" существующих записей.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФактическиеТрудозатраты.Подразделение,
	|	ФактическиеТрудозатраты.Пользователь,
	|	ФактическиеТрудозатраты.Источник,
	|	ФактическиеТрудозатраты.Проект,
	|	ФактическиеТрудозатраты.ПроектнаяЗадача,
	|	ФактическиеТрудозатраты.ВидРабот,
	|	ФактическиеТрудозатраты.ДатаДобавления,
	|	ФактическиеТрудозатраты.НомерДобавления,
	|	ФактическиеТрудозатраты.УдалитьОписаниеРаботы,
	|	ФактическиеТрудозатраты.Начало,
	|	ФактическиеТрудозатраты.Окончание
	|ИЗ
	|	РегистрСведений.ФактическиеТрудозатраты КАК ФактическиеТрудозатраты
	|ГДЕ
	|	ФактическиеТрудозатраты.ЕжедневныйОтчет = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.ФактическиеТрудозатраты.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
		МенеджерЗаписи.Прочитать();
		
		МенеджерЗаписи.ЕжедневныйОтчет = Неопределено;
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
	Политика = Константы.ПолитикаУчетаРабочегоВремени.Получить();
	Если Политика <> Перечисления.ПолитикиУчетаРабочегоВремени.ИспользоватьЕженедельныеОтчеты Тогда
		Возврат;
	КонецЕсли;
	
	// Очистим записи за период.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФактическиеТрудозатраты.Подразделение КАК Подразделение,
	|	ФактическиеТрудозатраты.Пользователь КАК Пользователь,
	|	ФактическиеТрудозатраты.Источник КАК Источник,
	|	ФактическиеТрудозатраты.Проект КАК Проект,
	|	ФактическиеТрудозатраты.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	ФактическиеТрудозатраты.ВидРабот КАК ВидРабот,
	|	ФактическиеТрудозатраты.ДатаДобавления КАК ДатаДобавления,
	|	ФактическиеТрудозатраты.НомерДобавления КАК НомерДобавления,
	|	ФактическиеТрудозатраты.УдалитьОписаниеРаботы КАК УдалитьОписаниеРаботы,
	|	ФактическиеТрудозатраты.Начало КАК Начало,
	|	ФактическиеТрудозатраты.Окончание КАК Окончание
	|ИЗ
	|	РегистрСведений.ФактическиеТрудозатраты КАК ФактическиеТрудозатраты
	|ГДЕ
	|	(ФактическиеТрудозатраты.ДатаДобавления МЕЖДУ &ДатаНачала И &ДатаОкончания
	|				И ФактическиеТрудозатраты.Пользователь = &Пользователь
	|			ИЛИ ФактическиеТрудозатраты.Источник = &Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаНачала", УчетВремениКлиентСервер.ДатаНачалаОтчетаЗаНеделю(Дата));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Дата));
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.ФактическиеТрудозатраты.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
		МенеджерЗаписи.Удалить();
	КонецЦикла;
	
	// Выполняем движения по данным еженедельного отчета.
	Запрос = Новый Запрос;
	ШаблонДня = 
		"ВЫБРАТЬ
		|	Работы.Проект КАК Проект,
		|	Работы.ПроектнаяЗадача КАК ПроектнаяЗадача,
		|	Работы.ВидРабот КАК ВидРабот,
		|	Работы.ВидРабот.ВидВремени КАК ВидВремени,
		|	Работы.Работа КАК Работа,
		|	Работы.Источник КАК Источник,
		|	Работы.ДатаДобавления КАК ДатаДобавления,
		|	ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, %1) КАК Дата,
		|	СУММА(ЧАС(Работы.%2) * 3600 + МИНУТА(Работы.%2) * 60) КАК Длительность,
		|	СУММА(ВЫБОР КОГДА Работы.ВидРабот.ВидВремени = ЗНАЧЕНИЕ(Перечисление.ВидыВремени.Рабочее)
		|		ТОГДА ЧАС(Работы.%2) * 3600 + МИНУТА(Работы.%2) * 60
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК ДлительностьРабочая
		|ИЗ
		|	Документ.ЕженедельныйОтчет.Работы КАК Работы
		|ГДЕ
		|	Работы.Ссылка = &Ссылка
		|	И ЧАС(Работы.%2) * 3600 + МИНУТА(Работы.%2) * 60 <> 0
		|СГРУППИРОВАТЬ ПО
		|	Работы.Проект,
		|	Работы.ПроектнаяЗадача,
		|	Работы.ВидРабот,
		|	Работы.ВидРабот.ВидВремени,
		|	Работы.Работа,
		|	Работы.Источник,
		|	Работы.ДатаДобавления,
		|	ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, %1)
		|";
	Запрос.Текст = Запрос.Текст +
		СтрШаблон(ШаблонДня, "0", "Сб") + "
		|ОБЪЕДИНИТЬ ВСЕ
		|";
	Запрос.Текст = Запрос.Текст +
		СтрШаблон(ШаблонДня, "1", "Вс") + "
		|ОБЪЕДИНИТЬ ВСЕ
		|";
	Запрос.Текст = Запрос.Текст +
		СтрШаблон(ШаблонДня, "2", "Пн") + "
		|ОБЪЕДИНИТЬ ВСЕ
		|";
	Запрос.Текст = Запрос.Текст +
		СтрШаблон(ШаблонДня, "3", "Вт") + "
		|ОБЪЕДИНИТЬ ВСЕ
		|";
	Запрос.Текст = Запрос.Текст +
		СтрШаблон(ШаблонДня, "4", "Ср") + "
		|ОБЪЕДИНИТЬ ВСЕ
		|";
	Запрос.Текст = Запрос.Текст +
		СтрШаблон(ШаблонДня, "5", "Чт") + "
		|ОБЪЕДИНИТЬ ВСЕ
		|";
	Запрос.Текст = Запрос.Текст +
		СтрШаблон(ШаблонДня, "6", "Пт") + "
		|УПОРЯДОЧИТЬ ПО ДатаДобавления
		|ИТОГИ СУММА(Длительность), СУММА(ДлительностьРабочая) ПО Дата
		|";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаНачала", УчетВремениКлиентСервер.НачалоПонедельника(Дата) - 3600 * 24 * 2);
	СписокДниНедели = Новый Структура("Сб, Вс, Пн, Вт, Ср, Чт, Пт");
	
	ГрафикРаботы = ГрафикиРаботы.ПолучитьГрафикРаботыПользователя(Пользователь);
	
	ВыборкаДни = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДни.Следующий() Цикл
		
		ЭтоРабочийДень = ГрафикиРаботы.ЭтоРабочийДень(Дата, ГрафикРаботы);
		ДлительностьРабочегоДня = ГрафикиРаботы.ПолучитьДлительностьРабочегоДня(Дата, ГрафикРаботы);
		ДлительностьСверхурочно = ?(ДлительностьРабочегоДня >= ВыборкаДни.ДлительностьРабочая,
			0,
			ВыборкаДни.ДлительностьРабочая - ДлительностьРабочегоДня);
		ВыборкаДетальные = ВыборкаДни.Выбрать();
		НомерДобавления = 1;
		
		Пока ВыборкаДетальные.Следующий() Цикл
			
			Движение = Движения.РабочееВремяПользователей.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальные);
			Движение.Регистратор = Ссылка;
			Движение.Пользователь = Пользователь;
			Движение.Подразделение = Подразделение;
			Движение.Период = ВыборкаДетальные.Дата;
			Движение.ДлительностьВсего = ВыборкаДетальные.Длительность;
			Движение.ДлительностьРабочая = ВыборкаДетальные.ДлительностьРабочая;
			Если ЭтоРабочийДень Тогда
				Если ВыборкаДетальные.ДлительностьРабочая >= ДлительностьСверхурочно Тогда
					Движение.ДлительностьСверхурочно = ДлительностьСверхурочно;
					ДлительностьСверхурочно = 0;
				Иначе
					Движение.ДлительностьСверхурочно = ВыборкаДетальные.ДлительностьРабочая;
					ДлительностьСверхурочно = ДлительностьСверхурочно - ВыборкаДетальные.ДлительностьРабочая;
				КонецЕсли;
			Иначе
				Движение.ДлительностьВВыходные = ВыборкаДетальные.ДлительностьРабочая;
			КонецЕсли;
			
			МенеджерЗаписи = РегистрыСведений.ФактическиеТрудозатраты.СоздатьМенеджерЗаписи();
			
			МенеджерЗаписи.Подразделение = Подразделение;
			МенеджерЗаписи.Пользователь = Пользователь;
			
			МенеджерЗаписи.ОписаниеРаботы = ВыборкаДетальные.Работа;
			МенеджерЗаписи.ВидРабот = ВыборкаДетальные.ВидРабот;
			МенеджерЗаписи.Источник = ВыборкаДетальные.Источник;
			
			МенеджерЗаписи.Проект = ВыборкаДетальные.Проект;
			МенеджерЗаписи.ПроектнаяЗадача = ВыборкаДетальные.ПроектнаяЗадача;
				
			МенеджерЗаписи.Длительность = Движение.ДлительностьВсего;
			МенеджерЗаписи.ДлительностьСверхурочно = Движение.ДлительностьСверхурочно;
			МенеджерЗаписи.ДлительностьВВыходные = Движение.ДлительностьВВыходные;
			
			МенеджерЗаписи.ДатаДобавления = ?(ЗначениеЗаполнено(ВыборкаДетальные.ДатаДобавления),
				ВыборкаДетальные.ДатаДобавления,
				ВыборкаДетальные.Дата);
			МенеджерЗаписи.НомерДобавления = НомерДобавления;
			НомерДобавления = НомерДобавления + 1;
			
			МенеджерЗаписи.ЕжедневныйОтчет = Ссылка;
			МенеджерЗаписи.Удалена = Ложь;
			
			МенеджерЗаписи.Записать();
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НастройкиУчетаВремени = УчетВремени.ПолучитьПерсональныеНастройкиУчетаВремениСервер();
	ВестиУчетПоПроектам = ПолучитьФункциональнуюОпцию("ВестиУчетПоПроектам");
	
	Для Каждого Строка Из Работы Цикл
		
		ИндексСтроки = Работы.Индекс(Строка);
		ВидВремени = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.ВидРабот, "ВидВремени");
		
		Если ЗначениеЗаполнено(Строка.ВидРабот) 
			И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.ВидРабот, "ПометкаУдаления") Тогда 
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В строке %1 указан вид деятельности, помеченный на удаление.'"),
				Строка.НомерСтроки);
				
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстСообщения,
				ЭтотОбъект,
				"Работы[" + ИндексСтроки + "].ВидРабот",, 
				Отказ);	
		КонецЕсли;
		
		Если ВестиУчетПоПроектам Тогда 
			Если ЗначениеЗаполнено(Строка.Проект) 
				И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Проект, "ПометкаУдаления") Тогда 
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'В строке %1 указан проект, помеченный на удаление.'"),
					Строка.НомерСтроки);
					
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ТекстСообщения,
					ЭтотОбъект,
					"Работы[" + ИндексСтроки + "].ПроектЗадача",, 
					Отказ);	
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоответствиеДнейНедели()

	Соответствие = Новый Соответствие;
	Соответствие[ПредопределенноеЗначение("Перечисление.ДниНедели.Суббота")] = "Сб";
	Соответствие[ПредопределенноеЗначение("Перечисление.ДниНедели.Воскресенье")] = "Вс";
	Соответствие[ПредопределенноеЗначение("Перечисление.ДниНедели.Понедельник")] = "Пн";
	Соответствие[ПредопределенноеЗначение("Перечисление.ДниНедели.Вторник")] = "Вт";
	Соответствие[ПредопределенноеЗначение("Перечисление.ДниНедели.Среда")] = "Ср";
	Соответствие[ПредопределенноеЗначение("Перечисление.ДниНедели.Четверг")] = "Чт";
	Соответствие[ПредопределенноеЗначение("Перечисление.ДниНедели.Пятница")] = "Пт";
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти

#КонецЕсли
